
'''Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в списке A.
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
*Пример:*

5
1 2 3 4 5
3
-> 1'''
'''
n = int(input('Введите количество элементов в списке: '))
A = list(map(int, input('Введите элементы списка: ').split()))
X = int(input('Введите число X: '))
count = 0
for num in A:
    if num == X:
        count += 1
print(count)'''

'''Задача 18: Требуется найти в списке A самый близкий по величине элемент к заданному числу X. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

*Пример:*

5
1 2 3 4 5
6
-> 5'''
'''
N = int(input('Введите количество элементов в списке: '))
A = []
for i in range(N):
   A.append(int(input('Введите число А: ')))
X = int(input('Введите число X: '))
min_diff = abs(X - A[0])
min_elem = A[0]
for i in range(1, N):
   diff = abs(X - A[i])
   if diff < min_diff:
       min_diff = diff
       min_elem = A[i]
print(min_elem)'''



